In [1]:
print("Hello")

Hello

In [2]:
def add(x):
    return x+1

print(add(3))

4

In [3]:
import threading
import time

def task(name,duration):
    print(f"Thread {name} starting \n")
    time.sleep(duration)
    print(f"Thread {name} complete \n")

thread1 = threading.Thread(target=task, args=("A", 2))
thread2 = threading.Thread(target=task, args=("B", 4))
thread3 = threading.Thread(target=task, args=("C", 1.5))

thread1.start()
thread2.start()
thread3.start()

thread1.join()
thread2.join()
thread3.join()

print("Finished!")

Thread A starting
Thread B starting

Thread C starting


Thread C complete

Thread A complete

Thread B complete

Finished!

In [5]:
import re

sentence = "I am a big yellow 17chickens bof"
match = re.search(r'17.*\s',sentence)

print(match.group())

17chickens

In [7]:
import pandas as pd

In [15]:
data = [["Timmah",21],["Peter",12],["Byron",72]]
df = pd.DataFrame(data,columns=["name","age"])
df

     name  age
0  Timmah   21
1   Peter   12
2   Byron   72

In [11]:
frame = pd.DataFrame(data,columns=["name","age"])
frame

    name  age
0    bob    2
1  peter    1
2  byron   72

In [16]:
import pandas as pd

# From a dictionary
data = {
    'Name': ['Alice', 'Bob', 'Charlie'],
    'Age': [25, 30, 35],
    'City': ['New York', 'Los Angeles', 'Chicago']
}
df = pd.DataFrame(data)
print(df)

      Name  Age         City
0    Alice   25     New York
1      Bob   30  Los Angeles
2  Charlie   35      Chicago

In [17]:
df.info

<bound method DataFrame.info of       Name  Age         City
0    Alice   25     New York
1      Bob   30  Los Angeles
2  Charlie   35      Chicago>

In [18]:
print (df.info)

<bound method DataFrame.info of       Name  Age         City
0    Alice   25     New York
1      Bob   30  Los Angeles
2  Charlie   35      Chicago>

In [19]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    3 non-null      object
 1   Age     3 non-null      int64
 2   City    3 non-null      object
dtypes: int64(1), object(2)
memory usage: 204.0+ bytes

In [20]:
df.describe()

        Age
count   3.0
mean   30.0
std     5.0
min    25.0
25%    27.5
50%    30.0
75%    32.5
max    35.0

In [21]:
print(df.describe())

        Age
count   3.0
mean   30.0
std     5.0
min    25.0
25%    27.5
50%    30.0
75%    32.5
max    35.0

In [22]:
column = df["Name"]

In [23]:
print(column)

0      Alice
1        Bob
2    Charlie
Name: Name, dtype: object

In [24]:
type(column)

pandas.core.series.Series

In [25]:
df = pd.read_csv("https://query1.finance.yahoo.com/v7/finance/download/GOOG?period1=1092873600&period2=1716940800&interval=1d&events=history&includeAdjustedClose=true")

In [26]:
df

,Date,Open,High,Low,Close,Adj Close,Volume
0,2004-08-19,2.490664,2.591785,2.390042,2.499133,2.499133,897427216
1,2004-08-20,2.515820,2.716817,2.503118,2.697639,2.697639,458857488
2,2004-08-23,2.758411,2.826406,2.716070,2.724787,2.724787,366857939
3,2004-08-24,2.770615,2.779581,2.579581,2.611960,2.611960,306396159
4,2004-08-25,2.614201,2.689918,2.587302,2.640104,2.640104,184645512
...,...,...,...,...,...,...,...
4972,2024-05-21,178.399994,179.820007,177.309998,179.539993,179.539993,14706000
4973,2024-05-22,178.399994,178.852005,176.779999,178.000000,178.000000,16189400
4974,2024-05-23,178.779999,179.910004,174.539993,175.059998,175.059998,14928400
4975,2024-05-24,176.520004,177.304001,175.199997,176.330002,176.330002,11400600
4976,2024-05-28,175.740005,178.509995,175.679993,178.020004,178.020004,15642400

In [27]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4977 entries, 0 to 4976
Data columns (total 7 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   Date       4977 non-null   object
 1   Open       4977 non-null   float64
 2   High       4977 non-null   float64
 3   Low        4977 non-null   float64
 4   Close      4977 non-null   float64
 5   Adj Close  4977 non-null   float64
 6   Volume     4977 non-null   int64
dtypes: float64(5), int64(1), object(1)
memory usage: 272.3+ KB

In [28]:
df.describe()

,Open,High,Low,Close,Adj Close,Volume
count,4977.000000,4977.000000,4977.000000,4977.000000,4977.000000,4.977000e+03
mean,44.081316,44.548467,43.640387,44.105351,44.105351,1.166029e+08
std,41.645254,42.114605,41.235786,41.688266,41.688266,1.501576e+08
min,2.470490,2.534002,2.390042,2.490913,2.490913,1.584340e+05
25%,12.957183,13.121318,12.833397,12.977856,12.977856,2.773400e+07
50%,26.888466,27.057501,26.652000,26.889673,26.889673,5.734200e+07
75%,59.593498,60.000000,59.111500,59.562500,59.562500,1.443912e+08
max,178.779999,179.949997,177.309998,179.539993,179.539993,1.650833e+09

In [29]:
df['Daily Return'] = df['Adj Close'].pct_change()

In [30]:
df['Daily Return']

0            NaN
1       0.079430
2       0.010064
3      -0.041408
4       0.010775
          ...
4972    0.006052
4973   -0.008577
4974   -0.016517
4975    0.007255
4976    0.009584
Name: Daily Return, Length: 4977, dtype: float64

In [31]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4977 entries, 0 to 4976
Data columns (total 8 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   Date          4977 non-null   object
 1   Open          4977 non-null   float64
 2   High          4977 non-null   float64
 3   Low           4977 non-null   float64
 4   Close         4977 non-null   float64
 5   Adj Close     4977 non-null   float64
 6   Volume        4977 non-null   int64
 7   Daily Return  4976 non-null   float64
dtypes: float64(6), int64(1), object(1)
memory usage: 311.2+ KB